ka2_2024/src/Catalogs/МашиночитаемыеДоверенностиЦБ/МашиночитаемыеДоверенностиЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МашиночитаемыеДоверенностиЦБ</name>
  <attributes>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОбИнформационнойСистеме</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверитель</name>
    <type>
      <types>DefinedType.ОрганизацияИлиСтрокаБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_НаимОрг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_СтрРег</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_НаимРегОрг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_РегНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_АдрРус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_АдрXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_АдрЛат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоБезДовФЛ</name>
    <type>
      <types>DefinedType.КонтрагентФизлицоИлиСтрокаБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоБезДовФЛ_СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоБезДовФЛ_Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоБезДовФЛ_Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентФизлицоИлиСтрокаБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяДоверенность</name>
    <type>
      <types>CatalogRef.МашиночитаемыеДоверенностиЦБ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННДоверителяРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМашиночитаемойДоверенностиКО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаявленияНаОтзыв</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТранзакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлВырузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПодпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаЗаявленияНаОтзыв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗаявленияНаОтзыв</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПодписьЗаявленияНаОтзыв</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубличныйКлюч</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Образ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолномочияПредставителя</name>
    <comment>Полномочия представителя</comment>
    <attributes>
      <name>ПризнакПолныеПолномочия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак01</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак02</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак03</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак04</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак05</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак06</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак07</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак08</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак09</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак10</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак11</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак12</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак13</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак14</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак15</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак16</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак17</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак19</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак20</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак21</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак22</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <comment>Код причины постановки</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФИО</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>EnumRef.СубъектыДоверенностиНалогоплательщика</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдостоверенияЛичности</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>EnumRef.СубъектыДоверенностиНалогоплательщика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДок</name>
      <type>
        <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>СерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВыдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/МашиночитаемыеДоверенностиЦБ/Forms/ФормаДоверителя/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Параметры.СтруктураДанных;
	
	Если СтруктураДанных.Свойство("ТолькоПросмотрФормы") И СтруктураДанных.ТолькоПросмотрФормы Тогда
		Элементы.ДоверительЮЛ_РоссийскаяОрганизация.ТолькоПросмотр 	= Истина;
		Элементы.ДоверительЮЛ_НаимОрг.ТолькоПросмотр 				= Истина;
		Элементы.ДоверительЮЛ_ИНН.ТолькоПросмотр 					= Истина;
		Элементы.ДоверительЮЛ_ОГРН.ТолькоПросмотр 					= Истина;
		Элементы.ДоверительЮЛ_СтрРег.ТолькоПросмотр 				= Истина;
		Элементы.ДоверительЮЛ_Адр.ТолькоПросмотр 					= Истина;
		Элементы.ДоверительЮЛ_НаимРегОрг.ТолькоПросмотр 			= Истина;
		Элементы.ДоверительЮЛ_РегНомер.ТолькоПросмотр 				= Истина;
		Элементы.ДоверительФЛ_ИНН.ТолькоПросмотр 					= Истина;
		Элементы.ДоверительФЛ_Гражданство.ТолькоПросмотр 			= Истина;
		Элементы.ДоверительФЛ_ОГРН.ТолькоПросмотр 					= Истина;
		Элементы.ДоверительФЛ_СНИЛС.ТолькоПросмотр 					= Истина;
		Элементы.ФормаКнопкаСохранить.Доступность 					= Ложь;
	КонецЕсли;
	
	Доверитель_ЮридическоеЛицо = (СтруктураДанных = Неопределено ИЛИ СтруктураДанных.Доверитель_ЮридическоеЛицо);
	ДоверительЮЛ_РоссийскаяОрганизация = (СтруктураДанных = Неопределено
		ИЛИ СтруктураДанных.ДоверительЮЛ_РоссийскаяОрганизация);
	
	Если СтруктураДанных <> Неопределено Тогда
		ДоверительЮЛ_НаимОрг 				= СтруктураДанных.ДоверительЮЛ_НаимОрг;
		ДоверительЮЛ_ИНН 					= СтруктураДанных.ДоверительЮЛ_ИНН;
		ДоверительЮЛ_ОГРН 					= СтруктураДанных.ДоверительЮЛ_ОГРН;
		ДоверительЮЛ_СтрРег 				= СтруктураДанных.ДоверительЮЛ_СтрРег;
		ДоверительЮЛ_НаимРегОрг 			= СтруктураДанных.ДоверительЮЛ_НаимРегОрг;
		ДоверительЮЛ_РегНомер 				= СтруктураДанных.ДоверительЮЛ_РегНомер;
		ДоверительЮЛ_Адр 					= СтруктураДанных.ДоверительЮЛ_Адр;
		ДоверительЮЛ_АдрXML 				= СтруктураДанных.ДоверительЮЛ_АдрXML;
		ДоверительФЛ_ИНН 					= СтруктураДанных.ДоверительФЛ_ИНН;
		ДоверительФЛ_ОГРН 					= СтруктураДанных.ДоверительФЛ_ОГРН;
		ДоверительФЛ_СНИЛС 					= СтруктураДанных.ДоверительФЛ_СНИЛС;
		ДоверительФЛ_Гражданство 			= СтруктураДанных.ДоверительФЛ_Гражданство;
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоверительЮЛ_ИностраннаяОрганизацияПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДоверительЮЛ_АдрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Доверитель_ЮридическоеЛицо ИЛИ НЕ ДоверительЮЛ_РоссийскаяОрганизация Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДоверительЮЛ_АдрНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"), ДоверительЮЛ_АдрXML);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверительЮЛ_АдрОчистка(Элемент, СтандартнаяОбработка)
	
	ДоверительЮЛ_АдрXML = "";
	ДоверительЮЛ_Адр = "";
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДоверительЮЛ_РоссийскаяОрганизация", 	ДоверительЮЛ_РоссийскаяОрганизация);
	СтруктураДанных.Вставить("ДоверительЮЛ_НаимОрг", 				ДоверительЮЛ_НаимОрг);
	СтруктураДанных.Вставить("ДоверительЮЛ_ИНН", 					ДоверительЮЛ_ИНН);
	СтруктураДанных.Вставить("ДоверительЮЛ_ОГРН", 					ДоверительЮЛ_ОГРН);
	СтруктураДанных.Вставить("ДоверительЮЛ_СтрРег", 				ДоверительЮЛ_СтрРег);
	СтруктураДанных.Вставить("ДоверительЮЛ_НаимРегОрг", 			ДоверительЮЛ_НаимРегОрг);
	СтруктураДанных.Вставить("ДоверительЮЛ_РегНомер", 				ДоверительЮЛ_РегНомер);
	СтруктураДанных.Вставить("ДоверительЮЛ_Адр", 					ДоверительЮЛ_Адр);
	СтруктураДанных.Вставить("ДоверительЮЛ_АдрXML", 				ДоверительЮЛ_АдрXML);
	СтруктураДанных.Вставить("ДоверительФЛ_ИНН", 					ДоверительФЛ_ИНН);
	СтруктураДанных.Вставить("ДоверительФЛ_ОГРН", 					ДоверительФЛ_ОГРН);
	СтруктураДанных.Вставить("ДоверительФЛ_СНИЛС", 					ДоверительФЛ_СНИЛС);
	СтруктураДанных.Вставить("ДоверительФЛ_Гражданство", 			ДоверительФЛ_Гражданство);
	
	Закрыть(СтруктураДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ГруппаЛевая.Видимость = Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ГруппаПравая.Видимость = НЕ Форма.Доверитель_ЮридическоеЛицо
		ИЛИ НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ГруппаПравая.Заголовок = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация,
		НСтр("ru = 'Руководитель обособленного подразделения иностранной организации'"),
		НСтр("ru = 'Индивидуальный предприниматель'"));
	
	Форма.Элементы.ДоверительЮЛ_НаимОрг.ПоложениеЗаголовка = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация,
		ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Авто);
	Форма.Элементы.ДоверительЮЛ_Адр.Заголовок = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация, НСтр("ru = 'Адрес в латинской транскрипции'"), "");
	Форма.Элементы.ДоверительЮЛ_Адр.ПоложениеЗаголовка = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация,
		ПоложениеЗаголовкаЭлементаФормы.Верх, ПоложениеЗаголовкаЭлементаФормы.Авто);
	Форма.Элементы.ДоверительЮЛ_Адр.РедактированиеТекста = Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительЮЛ_Адр.КнопкаВыбора = Форма.Доверитель_ЮридическоеЛицо
		И Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительЮЛ_ОГРН.Видимость = Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительЮЛ_СтрРег.Видимость = НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительЮЛ_НаимРегОрг.Видимость = НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительЮЛ_РегНомер.Видимость = НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	
	Форма.Элементы.ДоверительФЛ_СНИЛС.Видимость = НЕ Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ДоверительФЛ_ОГРН.Видимость = НЕ Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ДоверительФЛ_ИНН.Видимость = НЕ Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ДоверительФЛ_ИНН.АвтоОтметкаНезаполненного = НЕ Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ДоверительФЛ_ИНН.АвтоВыборНезаполненного = НЕ Форма.Доверитель_ЮридическоеЛицо;
	Форма.Элементы.ДоверительФЛ_Гражданство.АвтоОтметкаНезаполненного = Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительФЛ_Гражданство.АвтоВыборНезаполненного = Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация;
	Форма.Элементы.ДоверительФЛ_Гражданство.Подсказка = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация,
		НСтр("ru = 'Незаполненность поля означает лицо без гражданства'"), "");
	Форма.Элементы.ДоверительФЛ_Гражданство.ОтображениеПодсказки = ?(Форма.Доверитель_ЮридическоеЛицо
		И НЕ Форма.ДоверительЮЛ_РоссийскаяОрганизация, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Авто);
	
КонецПроцедуры

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если Доверитель_ЮридическоеЛицо Тогда
		Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_НаимОрг) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано наименование организации.'"),,
				"ДоверительЮЛ_НаимОрг",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_ИНН) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ИНН организации.'"),, "ДоверительЮЛ_ИНН",,
				Отказ);
		ИначеЕсли НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(
			ДоверительЮЛ_ИНН, Ложь) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ИНН организации.'"),,
				"ДоверительЮЛ_ИНН",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_Адр) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан адрес организации.'"),, "ДоверительЮЛ_Адр",,
				Отказ);
		КонецЕсли;
		
		Если ДоверительЮЛ_РоссийскаяОрганизация Тогда
			Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_ОГРН) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ОГРН организации.'"),, "ДоверительЮЛ_ОГРН",,
					Отказ);
			ИначеЕсли СтрДлина(ДоверительЮЛ_ОГРН) <> 13 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ОГРН организации.'"),,
					"ДоверительЮЛ_ОГРН",, Отказ);
			КонецЕсли;
			
		Иначе
			Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_СтрРег) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задана страна регистрации организации.'"),,
					"ДоверительЮЛ_СтрРег",, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_НаимРегОрг) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано наименование регистрирующего органа организации.'"),,
					"ДоверительЮЛ_НаимРегОрг",, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДоверительЮЛ_РегНомер) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан регистрационный номер организации.'"),,
					"ДоверительЮЛ_РегНомер",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДоверительФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(
				ДоверительФЛ_ИНН, Истина) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ИНН руководителя обособленного подразделения.'"),,
					"ДоверительЮЛ_ИНН",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если НЕ ЗначениеЗаполнено(ДоверительФЛ_ИНН) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ИНН.'"),, "ДоверительФЛ_ИНН",,
				Отказ);
		ИначеЕсли НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(
			ДоверительФЛ_ИНН, Истина) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ИНН.'"),,
				"ДоверительФЛ_ИНН",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДоверительФЛ_ОГРН) И СтрДлина(ДоверительФЛ_ОГРН) <> 15 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ОГРНИП.'"),,
				"ДоверительФЛ_ОГРН",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДоверительФЛ_СНИЛС) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан СНИЛС.'"),,
				"ДоверительФЛ_СНИЛС",, Отказ);
		ИначеЕсли СтрДлина(ДоверительФЛ_СНИЛС) <> 14 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный СНИЛС.'"),,
				"ДоверительФЛ_СНИЛС",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ДоверительЮЛ_АдрНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоверительЮЛ_АдрXML = Результат.КонтактнаяИнформация;
	ДоверительЮЛ_Адр = ДокументооборотСКОВызовСервера.ПредставлениеКонтактнойИнформации(Результат.КонтактнаяИнформация);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
